# Brewfile - packages managed by Homebrew on macOS and Linux
#
# if OS.mac? blocks: casks and macOS-specific tools (skipped on Linux)
# Everything else: cross-platform CLI tools installed on both platforms
#
# Usage:
#   macOS: brew bundle --file=~/dotfiles/packages/Brewfile
#   Linux: bash ~/dotfiles/install/linux-packages.sh

### Shells ###
brew "zsh"
brew "bash"
brew "fish"

### Editors ###
brew "vim"

### Git ###
brew "openssh"  # must precede system ssh in PATH; avoids OpenSSL version mismatch on Linux
brew "git"
brew "git-lfs"
brew "gh"
brew "glab"

### Search & Files ###
brew "tree"
# eza: modern ls (git column, tree mode). Brewfile, not cargo.txt — upstream
# publishes no darwin release binaries, so binstall would source-compile.
brew "eza"
brew "ncdu"
brew "fzf"
brew "jq"
brew "bc"  # statusline.sh arithmetic (ctx%/cost) — not guaranteed on minimal Linux
brew "bash-preexec"  # preexec/precmd hooks for bash — required by atuin history recording
brew "direnv"
brew "entr"
brew "xdelta"

### CLI Utilities ###
brew "wget"
brew "curl"
brew "less"
brew "rlwrap"
brew "cloc"
brew "imagemagick"
brew "fastfetch"
# opencl-headers: required by fastfetch for GPU info (CL/cl.h). Separate from
# opencl-icd-loader — headers and runtime are split packages.
brew "opencl-headers"
brew "fetch"
brew "tmux"
brew "moreutils"
brew "graphviz"

### Documents ###
brew "pandoc"

### Claude Code sandbox (Linux backend) ###
# macOS uses the built-in Seatbelt sandbox; Linux needs bubblewrap (user
# namespaces, no sudo) + socat (network proxy hop). See sandbox block in
# home/dot_claude/settings.json.
if OS.linux?
  brew "bubblewrap"
  brew "socat"
end

### Media ###
brew "ffmpeg"

### Monitoring ###
brew "htop"
brew "btop"
# glances: Python CLI tool — installed via uv (pip.txt) instead of brew.
# Brew's glances pulls python@3.13 which has the same PGO failures as 3.14
# on custom prefix, and we only patch 3.14.
# brew "glances"

### Compression ###
brew "lz4"
brew "zstd"

### Build Tools ###
brew "cmake"
brew "ninja"
brew "meson"
brew "gcc"
brew "gcc@13"
brew "gcc@15"
brew "llvm"   # clang, clang++, lldb, llvm-ar, opt, etc.
brew "llvm@21"
brew "llvm@22"
brew "lld"    # LLVM linker (now a separate formula)
brew "mold"   # fast modern linker
brew "ccache"  # C/C++ compiler cache
brew "sccache" # compiler cache with Rust support (RUSTC_WRAPPER)
# bacon: background cargo check/clippy/test on save (successor to cargo-watch).
# Brewfile, not cargo.txt — it publishes no prebuilt GitHub release binaries,
# and cargo.txt entries must binstall without source compilation.
brew "bacon"
brew "fftw"
brew "glfw"

### Languages ###
brew "python@3.14"  # patched on Linux (see patch-homebrew-python.sh); provides dev headers
brew "zig"
brew "go"  # Go toolchain; packages/go.txt drives `go install` via install/go.sh

### AI Coding Agents ###
brew "opencode"

### Token optimization ###
# rtk (Rust Token Killer): CLI proxy that compresses command output before it
# enters agent context (git/cargo/test runners etc.). Wired per harness:
# Claude + Cursor use thin wrappers delegating to rtk's built-in hook processor
# (`rtk hook claude` / `rtk hook cursor`); opencode + pi use in-process TS
# plugins calling `rtk rewrite` (no built-in hook exists for those). Codex is
# instruction-only (Codex ≥ 0.135 does support PreToolUse rewrites natively,
# but rtk ships no Codex hook yet — see the rtk gotcha in CLAUDE.md).
#
# Source: the OFFICIAL upstream tap, NOT homebrew-core. homebrew-core lags badly
# (0.29 vs upstream 0.42+), shipping an old rewrite registry and pre-v3 hook
# protocol. The tap tracks stable releases with prebuilt binaries for all 4
# platforms; Linux x86_64 is a musl static build (no glibc-version dependency).
# The `tap` line is required: trust_brewfile_taps() only *trusts* the tap (so
# brew won't refuse to load it) — `brew bundle` still needs the explicit tap
# directive to actually clone it. A bare three-part `brew` ref is not auto-tapped.
# NOT cargo.txt: the crates.io `rtk` crate is an unrelated project (Rust Type Kit).
tap "rtk-ai/tap"
brew "rtk-ai/tap/rtk"

### Debugging ###
# dap: daemonized Debug Adapter Protocol sessions — agents debug statefully
# via Bash (used by the debugging-code plugin)
tap "AlmogBaku/tap"
brew "AlmogBaku/tap/dap"

### Memory stack (see install/memory.sh + docs/usage/agents.md) ###
# cass (session-history search) is installed by install/memory.sh directly
# from GitHub releases with checksum verification — its brew tap lags asset
# re-uploads (hit a stale-sha failure June 2026).
# sqlite: qmd's vector index needs Homebrew SQLite on macOS (system libsqlite3
# blocks loadable extensions)
brew "sqlite"

### Security ###
brew "gitleaks"  # secret scanning — also used as a global pre-push hook
brew "bats-core" # bash test runner — tests/*.bats run locally, not just in docker

### DevOps ###
brew "opentofu"
brew "mdbook"
brew "podman"
brew "podman-compose"

### Retro / Embedded ###
brew "cc65"

### Databases ###
# surreal: SurrealDB CLI/server. Third-party tap — Homebrew requires explicit
# trust, applied by trust_brewfile_taps() in _lib.sh before brew bundle runs.
tap "surrealdb/tap"
brew "surrealdb/tap/surreal"

if OS.mac?
  ### Languages & Runtimes (macOS) ###
  brew "openjdk"
  # Free Wolfram Engine (full Mathematica kernel + wolframscript). Free for
  # personal/dev use; one-time activation with a Wolfram ID on first run:
  #   wolframscript   (prompts for login; 2 activation keys per account)
  # Used by the wolfram-language/wolfram-alpha agent skills via Bash — no MCP.
  # Linux: installer requires sudo, so headless boxes use the WolframAlpha
  # LLM API fallback documented in agents-common.md (~/.wolframalpha.env).
  cask "wolfram-engine"

  ### Dev Tools - VMs & Containers (macOS) ###
  brew "colima"
  brew "docker"
  brew "docker-compose"
  brew "docker-buildx"
  brew "qemu"
  brew "mas"

  ### Local AI ###
  brew "ollama"

  ### GPU Profiling ###
  cask "nvidia-nsight-systems"

  ### X11 ###
  brew "xorg-server"

  ### Terminal ###
  cask "ghostty"
  cask "tabby"

  ### Editors & IDEs ###
  cask "visual-studio-code"
  cask "cursor"

  ### AI Agent Tooling (macOS) ###
  # Linux gets these via go install — see packages/go.txt.
  tap "entireio/tap"
  cask "entire"  # captures AI agent sessions alongside git commits

  # Claude Desktop (GUI app; auto-updates in place). Preferences are tracked
  # by install/claude-desktop.sh (sync/apply) — not chezmoi, since the app
  # owns and rewrites its config file. Claude Code (the CLI) is separate, via
  # install/claude.sh.
  cask "claude"

  # Codex desktop app (GUI; auto-updates in place via Sparkle). NOTE: this is
  # `codex-app`, NOT the `codex` cask — that one is the CLI, which we already
  # get from npm (@openai/codex in npm.txt). The app shares ~/.codex/ with the
  # CLI, so its substantive config (config.toml, profiles, AGENTS.md, rules,
  # themes) is already tracked via install/codex.sh + chezmoi. Its GUI-only
  # prefs (theme, editor target, personality) live in ~/.codex/.codex-global-
  # state.json and are tracked separately by install/codex-desktop.sh — an
  # allowlist sync, because that file also holds prompt history + account data.
  cask "codex-app"

  ### Cloud CLIs (macOS) ###
  # Google Cloud SDK: `gcloud` (+ `gsutil`, `bq`). Two roles: (1) agents manage
  # GCP projects/secrets/deploys — `bash install/auth.sh gcloud` for the user
  # login; (2) it is the auth for Google's official remote MCP servers, which use
  # Application Default Credentials — `bash install/auth.sh google` runs that ADC
  # login (no OAuth client needed) and the auth=gcloud helpers mint tokens from
  # it. macOS-only here — the cask has no Linux equivalent; a no-sudo Linux box
  # would need the upstream tarball installer (not yet wired).
  cask "gcloud-cli"  # was "google-cloud-sdk" — renamed upstream 2026

  ### Window Management ###
  tap "nikitabobko/tap"
  cask "nikitabobko/tap/aerospace"
  cask "linearmouse"
  cask "jordanbaird-ice"
  cask "enjoyable"

  ### Productivity ###
  cask "alfred"
  cask "the-unarchiver"

  ### Browsers ###
  cask "firefox"

  ### Media ###
  brew "mpv"
  cask "vlc"
  cask "elmedia-player"
  cask "gimp"
  cask "inkscape"
  cask "spotify"
  cask "obs"
  cask "blender"
  cask "kdenlive"
  cask "touchdesigner"

  ### Documents ###
  cask "libreoffice"

  ### Games ###
  cask "openemu"
  cask "retroarch"
  cask "nestopia"
  cask "slippi-dolphin"
  cask "steam"
  cask "prismlauncher"

  ### VMs ###
  cask "utm"

  ### Fonts ###
  cask "font-jetbrains-mono"
  cask "font-powerline-symbols"

  ### Utilities ###
  cask "balenaetcher"
end
