# Brewfile - packages managed by Homebrew on macOS and Linux
#
# if OS.mac? blocks: casks and macOS-specific tools (skipped on Linux)
# Everything else: cross-platform CLI tools compiled from source on Linux
#
# Usage:
#   macOS: brew bundle --file=~/dotfiles/packages/Brewfile
#   Linux: see install/linux-packages.sh (runs brew bundle inside a container)

### Shells ###
brew "zsh"
brew "bash"
brew "fish"
brew "nushell"

### Editors ###
brew "vim"
brew "neovim"

### Git ###
brew "git"
brew "git-lfs"
brew "git-delta"
brew "difftastic"
brew "gh"

### Search & Files ###
brew "ripgrep"
# fd, sd, zoxide installed via cargo (packages/cargo.txt) — no Homebrew dupe
brew "bat"
brew "bat-extras"
brew "ast-grep"
brew "tree"
brew "ncdu"
brew "fzf"
brew "jq"
brew "direnv"
brew "entr"
brew "xdelta"

### CLI Utilities ###
brew "wget"
brew "curl"
brew "less"
brew "rlwrap"
brew "cloc"
brew "imagemagick"
brew "fastfetch"
brew "fetch"
brew "lynx"
brew "tmux"
brew "moreutils"
brew "pandoc"
brew "graphviz"
brew "texinfo"

### Media ###
brew "ffmpeg"

### Monitoring ###
brew "htop"
brew "btop"
brew "bottom"
brew "glances"

### Build Tools ###
brew "cmake"
brew "ninja"
brew "meson"
brew "llvm"
brew "fftw"
brew "glfw"
brew "openjdk"
brew "openssh"

### Languages ###
brew "zig"

### DevOps ###
brew "opentofu"

### Retro / Embedded ###
brew "cc65"

if OS.mac?
  ### Dev Tools - VMs & Containers (macOS) ###
  brew "colima"
  brew "docker"
  brew "podman"
  brew "qemu"
  brew "mas"

  ### X11 ###
  brew "xorg-server"

  ### Terminal ###
  cask "ghostty"
  cask "warp"
  cask "tabby"

  ### Editors & IDEs ###
  cask "visual-studio-code"
  cask "cursor"
  cask "dotnet-sdk"

  ### Window Management ###
  cask "nikitabobko/tap/aerospace"
  cask "linearmouse"
  cask "jordanbaird-ice"
  cask "enjoyable"

  ### Productivity ###
  cask "alfred"
  cask "the-unarchiver"
  cask "notion"

  ### Browsers ###
  cask "firefox"

  ### Media ###
  brew "mpv"
  cask "vlc"
  cask "elmedia-player"
  cask "gimp"
  cask "inkscape"
  cask "spotify"
  cask "obs"
  cask "blender"
  cask "kdenlive"

  ### Documents ###
  cask "mactex"
  cask "libreoffice"

  ### Games ###
  cask "openemu"
  cask "retroarch"
  cask "nestopia"
  cask "slippi-dolphin"
  cask "steam"
  cask "prismlauncher"

  ### VMs ###
  cask "utm"

  ### Fonts ###
  cask "font-jetbrains-mono"
  cask "font-powerline-symbols"

  ### Utilities ###
  cask "balenaetcher"
  cask "antigravity"
end

