# Brewfile - packages managed by Homebrew on macOS and Linux
#
# if OS.mac? blocks: casks and macOS-specific tools (skipped on Linux)
# Everything else: cross-platform CLI tools installed on both platforms
#
# Usage:
#   macOS: brew bundle --file=~/dotfiles/packages/Brewfile
#   Linux: bash ~/dotfiles/install/linux-packages.sh

### Shells ###
brew "zsh"
brew "bash"
brew "fish"

### Editors ###
# vim: requires python@3.14 which has persistent PGO test failures on custom
# prefixes. Use system vim or install neovim via other means.
# brew "vim"

### Git ###
brew "openssh"  # must precede system ssh in PATH; avoids OpenSSL version mismatch on Linux
brew "git"
brew "git-lfs"
brew "gh"

### Search & Files ###
brew "tree"
brew "ncdu"
brew "fzf"
brew "jq"
brew "direnv"
brew "entr"
brew "xdelta"

### CLI Utilities ###
brew "wget"
brew "curl"
brew "less"
brew "rlwrap"
brew "cloc"
# imagemagick: requires python@3.14 (PGO test failures on custom prefix)
# brew "imagemagick"
brew "fastfetch"
brew "fetch"
brew "tmux"
brew "moreutils"
# graphviz: requires python@3.14 (PGO test failures on custom prefix)
# brew "graphviz"

### Documents ###
brew "pandoc"

### Media ###
# ffmpeg: requires python@3.14 (PGO test failures on custom prefix)
# brew "ffmpeg"

### Monitoring ###
brew "htop"
brew "btop"
# glances: requires python@3.14 (PGO test failures on custom prefix)
# brew "glances"

### Compression ###
brew "lz4"
brew "zstd"

### Build Tools ###
brew "cmake"
brew "ninja"
brew "meson"
brew "gcc"
brew "gcc@13"
brew "llvm"   # clang, clang++, lldb, llvm-ar, opt, etc.
brew "llvm@21"
brew "lld"    # LLVM linker (now a separate formula)
brew "mold"   # fast modern linker
brew "ccache"  # C/C++ compiler cache
brew "sccache" # compiler cache with Rust support (RUSTC_WRAPPER)
brew "fftw"
brew "glfw"

### Languages ###
brew "zig"

### DevOps ###
brew "opentofu"
brew "mdbook"
brew "podman"

### Retro / Embedded ###
brew "cc65"

if OS.mac?
  ### Languages & Runtimes (macOS) ###
  brew "openjdk"
  brew "openssh"

  ### Dev Tools - VMs & Containers (macOS) ###
  brew "colima"
  brew "docker"
  brew "qemu"
  brew "mas"

  ### X11 ###
  brew "xorg-server"

  ### Terminal ###
  cask "ghostty"
  cask "tabby"

  ### Editors & IDEs ###
  cask "visual-studio-code"
  cask "cursor"

  ### Window Management ###
  cask "nikitabobko/tap/aerospace"
  cask "linearmouse"
  cask "jordanbaird-ice"
  cask "enjoyable"

  ### Productivity ###
  cask "alfred"
  cask "the-unarchiver"

  ### Browsers ###
  cask "firefox"

  ### Media ###
  brew "mpv"
  cask "vlc"
  cask "elmedia-player"
  cask "gimp"
  cask "inkscape"
  cask "spotify"
  cask "obs"
  cask "blender"
  cask "kdenlive"

  ### Documents ###
  cask "libreoffice"

  ### Games ###
  cask "openemu"
  cask "retroarch"
  cask "nestopia"
  cask "slippi-dolphin"
  cask "steam"
  cask "prismlauncher"

  ### VMs ###
  cask "utm"

  ### Fonts ###
  cask "font-jetbrains-mono"
  cask "font-powerline-symbols"

  ### Utilities ###
  cask "balenaetcher"
end
