# Cursor extensions — one extension ID per line
# Managed by install/cursor.sh
# Generate fresh list: cursor --list-extensions
analytic-signal.preview-mp4
anthropic.claude-code
anysphere.cpptools
anysphere.cursorpyright
anysphere.remote-containers
anysphere.remote-ssh
astro-build.astro-vscode
bierner.markdown-mermaid
charliermarsh.ruff
davidanson.vscode-markdownlint
donjayamanne.githistory
eamodio.gitlens
enkia.tokyo-night
github.vscode-pull-request-github
james-yu.latex-workshop
llvm-vs-code-extensions.vscode-clangd
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-playwright.playwright
ms-python.debugpy
ms-python.flake8
ms-python.python
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode-remote.remote-ssh-edit
ms-vscode.theme-tomorrowkit
myriad-dreamin.tinymist
nvidia.nsight-vscode-edition
openai.chatgpt
platformio.platformio-ide
polymeilex.wgsl
redhat.vscode-yaml
revng.llvm-ir
robbowen.synthwave-vscode
rust-lang.rust-analyzer
sdras.night-owl
sumneko.lua
tamasfe.even-better-toml
tinkercode.rightrace
tintinweb.graphviz-interactive-preview
unifiedjs.vscode-mdx
vadimcn.vscode-lldb
