# vscode-extensions.txt - VS Code extensions installed via `code --install-extension`
# Usage: install/vscode.sh reads this file
#
# Add extensions here or run `bash install/vscode.sh sync` to union
# currently installed extensions back into this file.
#
# Note: settings.json is NOT tracked (contains machine-specific credentials).
# Only extensions are managed here.

analytic-signal.preview-mp4
astro-build.astro-vscode
charliermarsh.ruff
davidanson.vscode-markdownlint
donjayamanne.githistory
github.copilot-chat
github.vscode-pull-request-github
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.flake8
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
ms-vscode.theme-tomorrowkit
nvidia.nsight-vscode-edition
platformio.platformio-ide
polymeilex.wgsl
redhat.vscode-yaml
robbowen.synthwave-vscode
sumneko.lua
tintinweb.graphviz-interactive-preview
unifiedjs.vscode-mdx
